---
kind: method
id: M:Autodesk.Revit.DB.AlphanumericRevisionSettings.GetSequence
source: html/05d90a7d-2132-9106-df38-0fe9c3c0bef0.htm
---
# Autodesk.Revit.DB.AlphanumericRevisionSettings.GetSequence Method

Gets a list containing the strings to be used as the numbering sequence for
 revisions with the Alphanumeric RevisionNumberType.

## Syntax (C#)
```csharp
public IList<string> GetSequence()
```